CATEGORY = {
  "봄": {
    "상의": [
      "셔츠&블라우스 - 긴소매",
      "피케&카라 티셔츠",
      "후드 티셔츠",
      "맨투맨&스웨트",
      "기타 상의",
      "긴소매 티셔츠",
      "니트&스웨터 - 긴소매",
      "피케&카라 티셔츠 - 긴소매"
    ],
    "아우터": [
      "블루종&MA-1",
      "레더&라이더스 자켓",
      "슈트&블레이저 재킷",
      "스타디움 재킷",
      "나일론&코치 재킷",
      "사파리&헌팅 재킷",
      "트러커 재킷",
      "트레이닝 재킷",
      "아노락 재킷",
      "카디건",
      "후드 집업",
      "플리스&뽀글이",
      "패딩 베스트",
      "환절기 코트"
    ],
    "하의": [
      "데님 팬츠",
      "트레이닝&조거 팬츠",
      "기타 하의",
      "코튼 팬츠",
      "슈트 팬츠&슬랙스",
      "기타 하의"
    ],
    "신발": [
      "캔버스/단화",
      "패션스니커즈화",
      "기타 스니커즈",
      "앵클/숏 부츠",
      "미들/하프 부츠",
      "워커",
      "더비 슈즈",
      "스트레이트 팁",
      "로퍼",
      "모카신"
    ]
  },
  "여름": {
    "상의": [
      "셔츠&블라우스 - 반소매",
      "피케&카라 티셔츠 - 반소매",
      "니트&스웨터 - 반소매",
      "반소매 티셔츠"
    ],
    "아우터": [],
    "하의": [
      "숏팬츠"
    ],
    "신발": [
      "캔버스/단화",
      "패션스니커즈화",
      "기타 스니커즈",
      "워커",
      "더비 슈즈",
      "스트레이트 팁",
      "로퍼",
      "모카신",
      "쪼리/플립플랍",
      "스포츠/캐주얼 샌들"
    ]
  },
  "가을": {
    "상의": [
      "셔츠&블라우스 - 긴소매",
      "피케&카라 티셔츠",
      "후드 티셔츠",
      "맨투맨&스웨트",
      "기타 상의",
      "긴소매 티셔츠",
      "니트&스웨터 - 긴소매",
      "피케&카라 티셔츠 - 긴소매"
    ],
    "아우터": [
      "블루종&MA-1",
      "레더&라이더스 자켓",
      "슈트&블레이저 재킷",
      "스타디움 재킷",
      "나일론&코치 재킷",
      "사파리&헌팅 재킷",
      "트러커 재킷",
      "트레이닝 재킷",
      "아노락 재킷",
      "카디건",
      "후드 집업",
      "플리스&뽀글이",
      "패딩 베스트",
      "환절기 코트"
    ],
    "하의": [
      "데님 팬츠",
      "트레이닝&조거 팬츠",
      "기타 하의",
      "코튼 팬츠",
      "슈트 팬츠&슬랙스",
      "기타 하의"
    ],
    "신발": [
      "캔버스/단화",
      "패션스니커즈화",
      "기타 스니커즈",
      "앵클/숏 부츠",
      "미들/하프 부츠",
      "워커",
      "더비 슈즈",
      "스트레이트 팁",
      "로퍼",
      "모카신"
    ]
  },
  "겨울": {
    "상의": [
      "셔츠&블라우스 - 긴소매",
      "후드 티셔츠",
      "맨투맨&스웨트",
      "기타 상의",
      "긴소매 티셔츠",
      "니트&스웨터 - 긴소매",
      "피케&카라 티셔츠 - 긴소매",
      "맨투맨&스웨트"
    ],
    "아우터": [
      "블루종&MA-1",
      "레더&라이더스 자켓",
      "슈트&블레이저 재킷",
      "스타디움 재킷",
      "나일론&코치 재킷",
      "사파리&헌팅 재킷",
      "트러커 재킷",
      "트레이닝 재킷",
      "아노락 재킷",
      "카디건",
      "후드 집업",
      "플리스&뽀글이",
      "패딩 베스트",
      "환절기 코트",
      "겨울 싱글 코트",
      "롱패딩&헤비 아우터",
      "무스탕&퍼",
      "겨울 기타 코트",
      "숏패딩&헤비 아우터",
      "겨울 더블 코트"
    ],
    "하의": [
      "데님 팬츠",
      "트레이닝&조거 팬츠",
      "기타 하의",
      "코튼 팬츠",
      "슈트 팬츠&슬랙스",
      "기타 하의"
    ],
    "신발": [
      "캔버스/단화",
      "패션스니커즈화",
      "기타 스니커즈",
      "앵클/숏 부츠",
      "미들/하프 부츠",
      "워커",
      "더비 슈즈",
      "스트레이트 팁",
      "로퍼",
      "모카신"
    ]
  }
}

COLOR_PALETTE_BY_SEASON = {
    "봄": ['오트밀', '아이보리', '화이트', '블랙', '베이지', '네이비', "흑청", "진청", "연청", "중청"],
    "여름": ['스카이블루', '네이비', '화이트', '블랙', "연청", "중청", "흑청"],
    "가을": ['화이트', '블랙', '버건디', '오트밀', '아이보리', '카키', '베이지', '브라운', "흑청", "진청", "중청"],
    "겨울": ['화이트', '그레이', '블랙', '네이비', '카키', "흑청", "진청", "중청"]
}

